//Найдите сумму элементов массива, содержащего четные числа от 2 до 20.

const arr = [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
let sum = 0;
let i = 0;
while (i < arr.length){
sum = sum + arr[i];
i++;
}

//Получить строку из цифр '01234567891011121314151617181920'
let str = '';
let i = 0;
while (i <= 20) {
 str = str + i;
 i++;
}

//Найдите сумму целых чисел от 1 до 20.
let sum = 0;
let x = 1;
while (x <= 20) {
 sum = sum + x;
 x = x + 1;
}

//Найдите сумму целых чисел от 10 до 30.
let sum = 0;
let x = 10;
while (x <= 30) {
 sum = sum + x;
 x = x + 1;
}

//Найдите сумму чисел 0.2 + 0.4 + 0.6 + ... + 10
let sum = 0;
let x = 0.2;
while (x <= 10) {
 sum = sum + x;
 x = x + 0.2;
}

//Найдите сумму чисел 0.1 + 0.2 + 0.3 + ... + 5
let sum = 0;
let x = 0.1;
while (x <= 5) {
 sum = sum + x;
 x = x + 0.1;
}

//Найдите сумму элементов массива.
const array = [1, 2, 3, 4];   // массив
let s = 0;                    // начальное значение суммы
let i = 0;                    // начальное значение индекса элемента массива
while (i < array.length){     // условие цикла
 s = s + array[i];           // к сумме прибавляется элемент массива с индексом i
 i++;                        // индекс увеличивается на 1
}

//Найдите сумму 1 + 1/2 + 1/3 + 1/4 + ... + 1/10.
let s = 0;
let x = 1;
while (x <= 10) {
 s = s + 1/x;
 x = x + 1;
}

//Получить строку из 20 единиц ('11111111111111111111')
let str = '';
let i = 0;
while (i < 20) {
 str = str + '1';
 i++;
}

//Найдите произведение целых чисел от 1 до 10.
let product = 1;
let x = 1;
while (x <= 10) {
 product = product * x;
 x = x + 1;
}

//Найдите сумму целых чисел от -4 до 25.
let sum = 0;
let x = -4;
while (x <= 25) {
sum = sum + x;
 x = x + 1;
}

//Найдите произведение чисел 0.3 * 0.6 * 0.9 * ... * 3
let product = 1;
let x = 0.3;
while (x <= 3) {
 product = product * x;
 x = x + 0.3;
}

//Получить строку из 15 букв "X"
let str = '';
let i = 0;
while (i < 15) {
 str = str + 'X';
 i++;
}

//Найдите сумму целых чисел от 80 до 250.
let sum = 0;
let x = 80;
while (x <= 250) {
 sum = sum + x;
 x = x + 1;
}

//Найдите произведение целых чисел от 3 до 18.
let product = 1;
let x = 3;
while (x <= 18) {
 product = product * x;
 x = x + 1;
}